JW-Control/platform-jwplc/JWPLC/JWPLC-2.0.0/boards.txt
esp32c6.menu.CPUFreq.160=160MHz (WiFi)
esp32c6.menu.CPUFreq.160.build.f_cpu=160000000L
esp32c6.menu.CPUFreq.120=120MHz (WiFi)
esp32c6.menu.CPUFreq.120.build.f_cpu=120000000L
esp32c6.menu.CPUFreq.80=80MHz (WiFi)
esp32c6.menu.CPUFreq.80.build.f_cpu=80000000L
esp32c6.menu.CPUFreq.40=40MHz
esp32c6.menu.CPUFreq.40.build.f_cpu=40000000L
esp32c6.menu.CPUFreq.20=20MHz
esp32c6.menu.CPUFreq.20.build.f_cpu=20000000L
esp32c6.menu.CPUFreq.10=10MHz
esp32c6.menu.CPUFreq.10.build.f_cpu=10000000L

esp32c6.menu.FlashMode.qio=QIO
esp32c6.menu.FlashMode.qio.build.flash_mode=dio
esp32c6.menu.FlashMode.qio.build.boot=qio
esp32c6.menu.FlashMode.dio=DIO
esp32c6.menu.FlashMode.dio.build.flash_mode=dio
esp32c6.menu.FlashMode.dio.build.boot=dio

esp32c6.menu.FlashFreq.80=80MHz
esp32c6.menu.FlashFreq.80.build.flash_freq=80m
esp32c6.menu.FlashFreq.40=40MHz
esp32c6.menu.FlashFreq.40.build.flash_freq=40m

esp32c6.menu.FlashSize.4M=4MB (32Mb)
esp32c6.menu.FlashSize.4M.build.flash_size=4MB
esp32c6.menu.FlashSize.8M=8MB (64Mb)
esp32c6.menu.FlashSize.8M.build.flash_size=8MB
esp32c6.menu.FlashSize.2M=2MB (16Mb)
esp32c6.menu.FlashSize.2M.build.flash_size=2MB
esp32c6.menu.FlashSize.16M=16MB (128Mb)
esp32c6.menu.FlashSize.16M.build.flash_size=16MB

esp32c6.menu.UploadSpeed.921600=921600
esp32c6.menu.UploadSpeed.921600.upload.speed=921600
esp32c6.menu.UploadSpeed.115200=115200
esp32c6.menu.UploadSpeed.115200.upload.speed=115200
esp32c6.menu.UploadSpeed.256000.windows=256000
esp32c6.menu.UploadSpeed.256000.upload.speed=256000
esp32c6.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32c6.menu.UploadSpeed.230400=230400
esp32c6.menu.UploadSpeed.230400.upload.speed=230400
esp32c6.menu.UploadSpeed.460800.linux=460800
esp32c6.menu.UploadSpeed.460800.macosx=460800
esp32c6.menu.UploadSpeed.460800.upload.speed=460800
esp32c6.menu.UploadSpeed.512000.windows=512000
esp32c6.menu.UploadSpeed.512000.upload.speed=512000

esp32c6.menu.DebugLevel.none=None
esp32c6.menu.DebugLevel.none.build.code_debug=0
esp32c6.menu.DebugLevel.error=Error
esp32c6.menu.DebugLevel.error.build.code_debug=1
esp32c6.menu.DebugLevel.warn=Warn
esp32c6.menu.DebugLevel.warn.build.code_debug=2
esp32c6.menu.DebugLevel.info=Info
esp32c6.menu.DebugLevel.info.build.code_debug=3
esp32c6.menu.DebugLevel.debug=Debug
esp32c6.menu.DebugLevel.debug.build.code_debug=4
esp32c6.menu.DebugLevel.verbose=Verbose
esp32c6.menu.DebugLevel.verbose.build.code_debug=5

esp32c6.menu.EraseFlash.none=Disabled
esp32c6.menu.EraseFlash.none.upload.erase_cmd=
esp32c6.menu.EraseFlash.all=Enabled
esp32c6.menu.EraseFlash.all.upload.erase_cmd=-e

esp32c6.menu.ZigbeeMode.default=Disabled
esp32c6.menu.ZigbeeMode.default.build.zigbee_mode=
esp32c6.menu.ZigbeeMode.default.build.zigbee_libs=
esp32c6.menu.ZigbeeMode.ed=Zigbee ED (end device)
esp32c6.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
esp32c6.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
esp32c6.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
esp32c6.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32c6.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native
esp32c6.menu.ZigbeeMode.ed_debug=Zigbee ED (end device) - Debug
esp32c6.menu.ZigbeeMode.ed_debug.build.zigbee_mode=-DZIGBEE_MODE_ED
esp32c6.menu.ZigbeeMode.ed_debug.build.zigbee_libs=-lesp_zb_api.ed.debug -lzboss_stack.ed.debug -lzboss_port.native.debug
esp32c6.menu.ZigbeeMode.zczr_debug=Zigbee ZCZR (coordinator/router) - Debug
esp32c6.menu.ZigbeeMode.zczr_debug.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32c6.menu.ZigbeeMode.zczr_debug.build.zigbee_libs=-lesp_zb_api.zczr.debug -lzboss_stack.zczr.debug -lzboss_port.native.debug

##############################################################

esp32h2.name=ESP32-H2 Base Board

esp32h2.bootloader.tool=esptool_py
esp32h2.bootloader.tool.default=esptool_py

esp32h2.upload.tool=esptool_py
esp32h2.upload.tool.default=esptool_py
esp32h2.upload.tool.network=esp_ota

esp32h2.upload.maximum_size=1310720
esp32h2.upload.maximum_data_size=327680
esp32h2.upload.flags=
esp32h2.upload.extra_flags=
esp32h2.upload.use_1200bps_touch=false
esp32h2.upload.wait_for_upload_port=false

esp32h2.serial.disableDTR=false
esp32h2.serial.disableRTS=false

esp32h2.build.tarch=riscv32
esp32h2.build.target=esp
esp32h2.build.mcu=esp32h2
esp32h2.build.core=esp32
esp32h2.build.variant=esp32h2
esp32h2.build.board=ESP32H2_DEV
esp32h2.build.bootloader_addr=0x0

esp32h2.build.cdc_on_boot=0
esp32h2.build.f_cpu=96000000L
esp32h2.build.flash_size=4MB
esp32h2.build.flash_freq=64m
esp32h2.build.img_freq=48m
esp32h2.build.flash_mode=qio
esp32h2.build.boot=qio
esp32h2.build.partitions=default
esp32h2.build.defines=

## IDE 2.0 Seems to not update the value
esp32h2.menu.JTAGAdapter.default=Disabled
esp32h2.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32h2.menu.JTAGAdapter.builtin=Integrated USB JTAG
esp32h2.menu.JTAGAdapter.builtin.build.openocdscript=esp32h2-builtin.cfg
esp32h2.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
esp32h2.menu.JTAGAdapter.external=FTDI Adapter
esp32h2.menu.JTAGAdapter.external.build.openocdscript=esp32h2-ftdi.cfg
esp32h2.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32h2.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32h2.menu.JTAGAdapter.bridge.build.openocdscript=esp32h2-bridge.cfg
esp32h2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32h2.menu.CDCOnBoot.default=Disabled
esp32h2.menu.CDCOnBoot.default.build.cdc_on_boot=0
esp32h2.menu.CDCOnBoot.cdc=Enabled
esp32h2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

esp32h2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32h2.menu.PartitionScheme.default.build.partitions=default
esp32h2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32h2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32h2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32h2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32h2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32h2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32h2.menu.PartitionScheme.minimal.build.partitions=minimal
esp32h2.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
esp32h2.menu.PartitionScheme.no_fs.build.partitions=no_fs
esp32h2.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
esp32h2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32h2.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32h2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32h2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32h2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32h2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32h2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32h2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32h2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32h2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32h2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32h2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32h2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32h2.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32h2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32h2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/128KB SPIFFS)
esp32h2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32h2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32h2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32h2.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32h2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32h2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32h2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32h2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
#esp32h2.menu.PartitionScheme.rainmaker=RainMaker 4MB
#esp32h2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
#esp32h2.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
#esp32h2.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
#esp32h2.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
#esp32h2.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
#esp32h2.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
#esp32h2.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
#esp32h2.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
esp32h2.menu.PartitionScheme.zigbee_2MB=Zigbee 2MB with spiffs
esp32h2.menu.PartitionScheme.zigbee_2MB.build.partitions=zigbee_2MB
esp32h2.menu.PartitionScheme.zigbee_2MB.upload.maximum_size=1310720
esp32h2.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
esp32h2.menu.PartitionScheme.zigbee.build.partitions=zigbee
esp32h2.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
esp32h2.menu.PartitionScheme.zigbee_8MB=Zigbee 8MB with spiffs
esp32h2.menu.PartitionScheme.zigbee_8MB.build.partitions=zigbee_8MB
esp32h2.menu.PartitionScheme.zigbee_8MB.upload.maximum_size=3407872
esp32h2.menu.PartitionScheme.zigbee_zczr_2MB=Zigbee ZCZR 2MB with spiffs
esp32h2.menu.PartitionScheme.zigbee_zczr_2MB.build.partitions=zigbee_zczr_2MB
esp32h2.menu.PartitionScheme.zigbee_zczr_2MB.upload.maximum_size=1310720
esp32h2.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
esp32h2.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
esp32h2.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
esp32h2.menu.PartitionScheme.zigbee_zczr_8MB=Zigbee ZCZR 8MB with spiffs
esp32h2.menu.PartitionScheme.zigbee_zczr_8MB.build.partitions=zigbee_zczr_8MB
esp32h2.menu.PartitionScheme.zigbee_zczr_8MB.upload.maximum_size=3407872
esp32h2.menu.PartitionScheme.custom=Custom
esp32h2.menu.PartitionScheme.custom.build.partitions=
esp32h2.menu.PartitionScheme.custom.upload.maximum_size=16777216

esp32h2.menu.FlashMode.qio=QIO
esp32h2.menu.FlashMode.qio.build.flash_mode=dio
esp32h2.menu.FlashMode.qio.build.boot=qio
esp32h2.menu.FlashMode.dio=DIO
esp32h2.menu.FlashMode.dio.build.flash_mode=dio
esp32h2.menu.FlashMode.dio.build.boot=dio

