JW-Control/platform-jwplc/JWPLC/JWPLC-2.0.0/boards.txt
esp32h2.menu.FlashFreq.64=64MHz
esp32h2.menu.FlashFreq.64.build.flash_freq=64m
esp32h2.menu.FlashFreq.64.build.img_freq=48m
#esp32h2.menu.FlashFreq.32=32MHz
#esp32h2.menu.FlashFreq.32.build.flash_freq=32m
#esp32h2.menu.FlashFreq.32.build.img_freq=24m
esp32h2.menu.FlashFreq.16=16MHz
esp32h2.menu.FlashFreq.16.build.flash_freq=16m
esp32h2.menu.FlashFreq.16.build.img_freq=12m

esp32h2.menu.FlashSize.4M=4MB (32Mb)
esp32h2.menu.FlashSize.4M.build.flash_size=4MB
esp32h2.menu.FlashSize.8M=8MB (64Mb)
esp32h2.menu.FlashSize.8M.build.flash_size=8MB
esp32h2.menu.FlashSize.2M=2MB (16Mb)
esp32h2.menu.FlashSize.2M.build.flash_size=2MB
esp32h2.menu.FlashSize.16M=16MB (128Mb)
esp32h2.menu.FlashSize.16M.build.flash_size=16MB

esp32h2.menu.UploadSpeed.921600=921600
esp32h2.menu.UploadSpeed.921600.upload.speed=921600
esp32h2.menu.UploadSpeed.115200=115200
esp32h2.menu.UploadSpeed.115200.upload.speed=115200
esp32h2.menu.UploadSpeed.256000.windows=256000
esp32h2.menu.UploadSpeed.256000.upload.speed=256000
esp32h2.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32h2.menu.UploadSpeed.230400=230400
esp32h2.menu.UploadSpeed.230400.upload.speed=230400
esp32h2.menu.UploadSpeed.460800.linux=460800
esp32h2.menu.UploadSpeed.460800.macosx=460800
esp32h2.menu.UploadSpeed.460800.upload.speed=460800
esp32h2.menu.UploadSpeed.512000.windows=512000
esp32h2.menu.UploadSpeed.512000.upload.speed=512000

esp32h2.menu.DebugLevel.none=None
esp32h2.menu.DebugLevel.none.build.code_debug=0
esp32h2.menu.DebugLevel.error=Error
esp32h2.menu.DebugLevel.error.build.code_debug=1
esp32h2.menu.DebugLevel.warn=Warn
esp32h2.menu.DebugLevel.warn.build.code_debug=2
esp32h2.menu.DebugLevel.info=Info
esp32h2.menu.DebugLevel.info.build.code_debug=3
esp32h2.menu.DebugLevel.debug=Debug
esp32h2.menu.DebugLevel.debug.build.code_debug=4
esp32h2.menu.DebugLevel.verbose=Verbose
esp32h2.menu.DebugLevel.verbose.build.code_debug=5

esp32h2.menu.EraseFlash.none=Disabled
esp32h2.menu.EraseFlash.none.upload.erase_cmd=
esp32h2.menu.EraseFlash.all=Enabled
esp32h2.menu.EraseFlash.all.upload.erase_cmd=-e

esp32h2.menu.ZigbeeMode.default=Disabled
esp32h2.menu.ZigbeeMode.default.build.zigbee_mode=
esp32h2.menu.ZigbeeMode.default.build.zigbee_libs=
esp32h2.menu.ZigbeeMode.ed=Zigbee ED (end device)
esp32h2.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
esp32h2.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
esp32h2.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
esp32h2.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32h2.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native
esp32h2.menu.ZigbeeMode.ed_debug=Zigbee ED (end device) - Debug
esp32h2.menu.ZigbeeMode.ed_debug.build.zigbee_mode=-DZIGBEE_MODE_ED
esp32h2.menu.ZigbeeMode.ed_debug.build.zigbee_libs=-lesp_zb_api.ed.debug -lzboss_stack.ed.debug -lzboss_port.native.debug
esp32h2.menu.ZigbeeMode.zczr_debug=Zigbee ZCZR (coordinator/router) - Debug
esp32h2.menu.ZigbeeMode.zczr_debug.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32h2.menu.ZigbeeMode.zczr_debug.build.zigbee_libs=-lesp_zb_api.zczr.debug -lzboss_stack.zczr.debug -lzboss_port.native.debug

###############################
### JWPLC Basic Board       ###
###############################

jwplcbasic.name=JWPLC Basic

jwplcbasic.bootloader.tool=esptool_py
jwplcbasic.bootloader.tool.default=esptool_py

jwplcbasic.upload.tool=esptool_py
jwplcbasic.upload.tool.default=esptool_py
jwplcbasic.upload.tool.network=esp_ota

jwplcbasic.upload.maximum_size=1310720
jwplcbasic.upload.maximum_data_size=327680
jwplcbasic.upload.speed=921600
jwplcbasic.upload.erase_cmd=
jwplcbasic.upload.flags=
jwplcbasic.upload.extra_flags=

jwplcbasic.serial.disableDTR=true
jwplcbasic.serial.disableRTS=true

jwplcbasic.build.tarch=xtensa
jwplcbasic.build.bootloader_addr=0x1000
jwplcbasic.build.target=esp32
jwplcbasic.build.mcu=esp32
jwplcbasic.build.core=jwcontrol
jwplcbasic.build.variant=jwplcbasic
jwplcbasic.build.board=JWPLCBASIC

jwplcbasic.build.f_cpu=240000000L
jwplcbasic.build.flash_size=4MB
jwplcbasic.build.flash_freq=40m
jwplcbasic.build.flash_mode=dio
jwplcbasic.build.boot=qio
jwplcbasic.build.partitions=default
jwplcbasic.build.defines=-DJWPLC_BASIC -DHAVE_TCA6424A
jwplcbasic.build.loop_core=
jwplcbasic.build.event_core=

### Menú de particiones
jwplcbasic.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
jwplcbasic.menu.PartitionScheme.default.build.partitions=default
jwplcbasic.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
jwplcbasic.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
jwplcbasic.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
jwplcbasic.menu.PartitionScheme.minimal.build.partitions=minimal
jwplcbasic.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
jwplcbasic.menu.PartitionScheme.no_fs.build.partitions=no_fs
jwplcbasic.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
jwplcbasic.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
jwplcbasic.menu.PartitionScheme.no_ota.build.partitions=no_ota
jwplcbasic.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
jwplcbasic.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
jwplcbasic.menu.PartitionScheme.huge_app.build.partitions=huge_app
jwplcbasic.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
jwplcbasic.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/128KB SPIFFS)
jwplcbasic.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
jwplcbasic.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
jwplcbasic.menu.PartitionScheme.custom=Custom
jwplcbasic.menu.PartitionScheme.custom.build.partitions=
jwplcbasic.menu.PartitionScheme.custom.upload.maximum_size=16777216

### Menú de frecuencia CPU
jwplcbasic.menu.CPUFreq.240=240MHz (WiFi/BT)
jwplcbasic.menu.CPUFreq.240.build.f_cpu=240000000L
jwplcbasic.menu.CPUFreq.160=160MHz (WiFi/BT)
jwplcbasic.menu.CPUFreq.160.build.f_cpu=160000000L
jwplcbasic.menu.CPUFreq.80=80MHz (WiFi/BT)
jwplcbasic.menu.CPUFreq.80.build.f_cpu=80000000L

### Menú de frecuencia Flash
jwplcbasic.menu.FlashFreq.80=80MHz
jwplcbasic.menu.FlashFreq.80.build.flash_freq=80m
jwplcbasic.menu.FlashFreq.40=40MHz
jwplcbasic.menu.FlashFreq.40.build.flash_freq=40m

### Opcional: afinidad de núcleos
jwplcbasic.menu.LoopCore.1=Core 1
jwplcbasic.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
jwplcbasic.menu.LoopCore.0=Core 0
jwplcbasic.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

jwplcbasic.menu.EventsCore.1=Core 1
jwplcbasic.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
jwplcbasic.menu.EventsCore.0=Core 0
jwplcbasic.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0